In [3]:
import pandas as pd
titanic_df=pd.read_csv("titanic.csv")

In [5]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
titanic_df.dropna(subset=["Age"],inplace=True)

In [16]:
from datetime import date, datetime, timedelta
titanic_date = pd.to_datetime("1950-04-01")
titanic_df["dob"] = titanic_df["Age"].apply(lambda x:titanic_date - timedelta(days = x*365))

In [17]:
titanic_df[["Age","dob"]]

      Age        dob
0    22.0 1928-04-06
1    38.0 1912-04-10
2    26.0 1924-04-07
3    35.0 1915-04-10
4    35.0 1915-04-10
..    ...        ...
885  39.0 1911-04-11
886  27.0 1923-04-08
887  19.0 1931-04-06
889  26.0 1924-04-07
890  32.0 1918-04-09

[714 rows x 2 columns]

In [19]:
print(datetime.strptime("1950-10-2","%Y-%m-%d")) # strptime is a function which Passes String into datetime object

1950-10-02 00:00:00

In [21]:
new_date = datetime.strptime("1950-10-2",'%Y-%m-%d')
new_date

datetime.datetime(1950, 10, 2, 0, 0)

In [23]:
type(new_date)

datetime.datetime

In [22]:
datetime.strftime(new_date,"%m/%Y/%d") # strftime is the function which passes date object into string
new_date

datetime.datetime(1950, 10, 2, 0, 0)

In [25]:
titanic_df.pivot_table(index="Pclass",columns="Sex",values="Survived",aggfunc="mean")

Sex       female      male
Pclass
1       0.964706  0.396040
2       0.918919  0.151515
3       0.460784  0.150198

In [26]:
titanic_df.pivot_table(index='Cabin',columns="Sex",values="Fare",aggfunc="sum")

Sex    female     male
Cabin
A10       NaN  40.1250
A16    39.600      NaN
A20       NaN  56.9292
A23       NaN  30.0000
A24       NaN  50.4958
...       ...      ...
F2        NaN  78.0000
F33    34.000      NaN
F4     39.000  39.0000
G6     54.325      NaN
T         NaN  35.5000

[134 rows x 2 columns]

In [ ]:
# Timestamp question?